# Terraform `environment` `prod`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.syncroot_pushers will be created
  + resource "azurerm_resource_group" "syncroot_pushers" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "DIS_github_altinn_uami-rg"
    }

  # module.syncroot_github_repo["dialogporten"].azurerm_federated_identity_credential.syncroot_pusher_branches["main"] will be created
  + resource "azurerm_federated_identity_credential" "syncroot_pusher_branches" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "Altinn-dialogporten-manifests-ref-main"
      + parent_id           = (known after apply)
      + resource_group_name = "DIS_github_altinn_uami-rg"
      + subject             = "repo:Altinn/dialogporten-manifests:ref:refs/heads/main"
    }

  # module.syncroot_github_repo["dialogporten"].azurerm_role_assignment.altinncr_pusher will be created
  + resource "azurerm_role_assignment" "altinncr_pusher" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = "4f82b8bc-9810-5833-976a-9677eeaa8ba5"
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr"
      + skip_service_principal_aad_check = true
    }

  # module.syncroot_github_repo["dialogporten"].azurerm_user_assigned_identity.syncroot_pusher will be created
  + resource "azurerm_user_assigned_identity" "syncroot_pusher" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "Altinn-dialogporten-manifests-dialogporten-syncroot"
      + principal_id        = (known after apply)
      + resource_group_name = "DIS_github_altinn_uami-rg"
      + tags                = {
          + "env"                      = "prod"
          + "finops_environment"       = "prod"
          + "finops_product"           = "dis"
          + "finops_serviceownercode"  = null
          + "finops_serviceownerorgnr" = null
          + "org"                      = null
          + "product"                  = "dialogporten"
          + "repository"               = "https://github.com/Altinn/altinn-platform"
          + "submodule"                = "oidc-syncroot-pusher"
        }
      + tenant_id           = (known after apply)
    }

  # module.syncroot_github_repo["dialogporten"].github_actions_secret.azure_client_id will be created
  + resource "github_actions_secret" "azure_client_id" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "dialogporten-manifests"
      + repository_id     = (known after apply)
      + secret_name       = "DIS_SYNCROOT_AZURE_CLIENT_ID"
      + updated_at        = (known after apply)
    }

  # module.syncroot_github_repo["dialogporten"].github_actions_secret.azure_subscription_id will be created
  + resource "github_actions_secret" "azure_subscription_id" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "dialogporten-manifests"
      + repository_id     = (known after apply)
      + secret_name       = "DIS_SYNCROOT_AZURE_SUBSCRIPTION_ID"
      + updated_at        = (known after apply)
    }

  # module.syncroot_github_repo["dialogporten"].github_actions_secret.azure_tenant_id will be created
  + resource "github_actions_secret" "azure_tenant_id" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "dialogporten-manifests"
      + repository_id     = (known after apply)
      + secret_name       = "DIS_SYNCROOT_AZURE_TENANT_ID"
      + updated_at        = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.syncroot_github_repo["dialogporten"].azurerm_federated_identity_credential.syncroot_pusher_branches["main"],
  on ../modules/syncroot-github-repo/azure-identity.tf line 24, in resource "azurerm_federated_identity_credential" "syncroot_pusher_branches":
  24:   resource_group_name = var.resource_group_name

This field is no longer used and will be removed in the next major version of
the Azure Provider

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `push` |
| Working Directory | `./infrastructure/syncroots` |
| State File | `github.com/altinn/altinn-platform/environments/prod/syncroots.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_prod_syncroots.tfstate.tfplan` |